package resolvers.webPagesResolver.nothing;

/**
 * @author Artem Karnov @date 07.01.17.
 *         artem.karnov@t-systems.com
 **/
public class Todo {
    // TODO: 07.01.17  Робастный слой дао - без всякой херни чтобы работали 3 ентити и все операции с ними
    // TODO: 07.01.17  Навести порядок в помниках
    // TODO: 07.01.17  Дтоихи - желатльно сделать из вместе для соапа и реста
    // TODO: 07.01.17  Запилить хорошое логирование и эксепшеонироваание на нижние слои
    // TODO: 07.01.17  Запилить всю функциональность на ресте
    // TODO: 07.01.17  Запилить всю функциональность на соапе
    // TODO: 07.01.17  Логирование и эксепшеонирование по всему приложениею
    // TODO: 07.01.17  Переход на буст и спринг дату
    // TODO: 07.01.17  Добавить функциональность месседжей
    // TODO: 07.01.17  Прикрутить актив mq
    // TODO: 07.01.17  Переход на java 8
    // TODO: 07.01.17 Continues delevery
}
